app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "Q5LsvpgtrsNIlfeYYqhtzQ"], ["LIMIT", 1]]
---
    def self.random_code
        loop do
            random_code = SecureRandom.urlsafe_base64(16)
            return random_code unless ShortenedUrl.exists?(short_url: random_code)

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.google.com"], ["short_url", "Q5LsvpgtrsNIlfeYYqhtzQ"], ["user_id", 1], ["created_at", "2021-01-07 19:44:04.661623"], ["updated_at", "2021-01-07 19:44:04.661623"]]
---
    def self.create_for_user_and_long_url(user,long_url)