app/models/visit.rb

INSERT INTO "visits" ("short_url_id", "visitor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["short_url_id", 2], ["visitor_id", 1], ["created_at", "2021-01-07 20:00:19.235141"], ["updated_at", "2021-01-07 20:00:19.235141"]]
---
    def self.record_visit!(user, shortened_url)
        Visit.create!(
            user_id: user.id,
            shortened_url_id: shortened_url.id
        )